# Salary predicator used by HR of a company

In [28]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from word2number import w2n#libary to convert word to number

In [29]:
data=pd.read_csv("E:\\ML DATA\hiring.csv")

In [30]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [31]:
data.experience = data.experience.fillna("zero")

In [32]:
import math

In [33]:
a= math.floor(data['test_score(out of 10)'].mean())
a

7

In [34]:
data['test_score(out of 10)'] = data['test_score(out of 10)'].fillna(a)

In [35]:
data['experience']=data['experience'].apply(w2n.word_to_num)

In [24]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [36]:
lr=LinearRegression()

In [45]:
lr.fit(data[['experience','test_score(out of 10)','interview_score(out of 10)']],data['salary($)'])

LinearRegression()

In [48]:
lr.predict([[2,9,6]])

array([53713.86677124])

In [50]:
lr.predict([[0,0,0]])

array([14992.65144669])